//********** ФУНКЦИИ ЗВУКОВОГО СИГНАЛА ЗУММЕРА **********//



//Подача короткого звукового сигнала при нажатии физических кнопок SET, UP, DOWN
void buzBtn() {
  tone(BUZZER, 2100, 40);  // Включить звуковой сигнал частотой в 2100Гц на 40мс
}


// Звук ошибки чтения температуры с датчика
void buzErr() {
  for (byte i = 0; i < 5; i++) {  // Выполняем цикл подачи короткого звукового сигнала 5 раз с паузами
    tone(BUZZER, 650, 100);       // Включить звуковой сигнал частотой в 650Гц на 100мс
    delay(400);                   // Тишина 400мс
  }
}


//Подача короткого звукового сигнала при нажатии физической кнопоки Reset
void buzRes() {
  for (byte i = 0; i < 5; i++) {  // Выполняем цикл подачи короткого звукового сигнала 5 раз с паузами
    tone(BUZZER, 700, 100);       // Включить звуковой сигнал частотой в 700Гц на 100мс
    delay(200);                   // Тишина 200мс
  }
}


//Подача короткого звукового сигнала 1 раз каждый час (если включено на WEB интерфейсе)
void buzHourly() {
  if (Flag_SigNight == false) {  // Если флаг ежечасного сигнала в ночное время опущен, то разрешаем подачу сигнала, иначе нет
    tone(BUZZER, 800, 100);      // Включить звуковой сигнал частотой в 800Гц на 100мс
  }
}